{
  "format": "graph-model",
  "generatedBy": "2.15.0",
  "convertedBy": "TensorFlow.js Converter v4.14.0",
  "signature": {
    "inputs": {
      "sequential_7_input": {
        "name": "sequential_7_input:0",
        "dtype": "DT_FLOAT",
        "tensorShape": {
          "dim": [
            { "size": "-1" },
            { "size": "512" },
            { "size": "512" },
            { "size": "3" }
          ]
        }
      }
    },
    "outputs": {
      "outputs": {
        "name": "Identity:0",
        "dtype": "DT_FLOAT",
        "tensorShape": { "dim": [{ "size": "-1" }, { "size": "2" }] }
      }
    }
  },
  "modelTopology": {
    "node": [
      {
        "name": "StatefulPartitionedCall/sequential_9/rescaling_5/Cast/x",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": {} } },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_9/rescaling_5/Cast_1/x",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": {} } }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_9/conv2d_12/Conv2D/ReadVariableOp",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "16" }
                ]
              }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_9/conv2d_12/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "16" }] }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_9/conv2d_13/Conv2D/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "16" },
                  { "size": "32" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_9/conv2d_13/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "32" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_9/conv2d_14/Conv2D/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "32" },
                  { "size": "64" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_9/conv2d_14/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_9/flatten_4/Const",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "2" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_9/dense_5/MatMul/ReadVariableOp",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [{ "size": "262144" }, { "size": "128" }]
              }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_9/dense_5/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "128" }] }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_9/outputs/MatMul/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "128" }, { "size": "2" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_9/outputs/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "2" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "sequential_7_input",
        "op": "Placeholder",
        "attr": {
          "shape": {
            "shape": {
              "dim": [
                { "size": "-1" },
                { "size": "512" },
                { "size": "512" },
                { "size": "3" }
              ]
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_9/rescaling_5/mul",
        "op": "Mul",
        "input": [
          "sequential_7_input",
          "StatefulPartitionedCall/sequential_9/rescaling_5/Cast/x"
        ],
        "attr": { "T": { "type": "DT_FLOAT" } }
      },
      {
        "name": "StatefulPartitionedCall/sequential_9/rescaling_5/add",
        "op": "AddV2",
        "input": [
          "StatefulPartitionedCall/sequential_9/rescaling_5/mul",
          "StatefulPartitionedCall/sequential_9/rescaling_5/Cast_1/x"
        ],
        "attr": { "T": { "type": "DT_FLOAT" } }
      },
      {
        "name": "StatefulPartitionedCall/sequential_9/conv2d_12/Relu",
        "op": "_FusedConv2D",
        "input": [
          "StatefulPartitionedCall/sequential_9/rescaling_5/add",
          "StatefulPartitionedCall/sequential_9/conv2d_12/Conv2D/ReadVariableOp",
          "StatefulPartitionedCall/sequential_9/conv2d_12/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "T": { "type": "DT_FLOAT" },
          "num_host_args": { "i": "0" },
          "TArgs": { "list": { "type": ["DT_FLOAT"] } },
          "filter_format": { "s": "SFdJTw==" },
          "use_cudnn_on_gpu": { "b": true },
          "explicit_paddings": { "list": {} },
          "data_format": { "s": "TkhXQw==" },
          "epsilon": { "f": 0.0 },
          "leakyrelu_alpha": { "f": 0.2 },
          "strides": { "list": { "i": ["1", "1", "1", "1"] } },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdQ=="] } },
          "num_args": { "i": "1" },
          "padding": { "s": "U0FNRQ==" },
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_9/max_pooling2d_12/MaxPool",
        "op": "MaxPool",
        "input": ["StatefulPartitionedCall/sequential_9/conv2d_12/Relu"],
        "attr": {
          "ksize": { "list": { "i": ["1", "2", "2", "1"] } },
          "explicit_paddings": { "list": {} },
          "padding": { "s": "VkFMSUQ=" },
          "T": { "type": "DT_FLOAT" },
          "data_format": { "s": "TkhXQw==" },
          "strides": { "list": { "i": ["1", "2", "2", "1"] } }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_9/conv2d_13/Relu",
        "op": "_FusedConv2D",
        "input": [
          "StatefulPartitionedCall/sequential_9/max_pooling2d_12/MaxPool",
          "StatefulPartitionedCall/sequential_9/conv2d_13/Conv2D/ReadVariableOp",
          "StatefulPartitionedCall/sequential_9/conv2d_13/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "TArgs": { "list": { "type": ["DT_FLOAT"] } },
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } },
          "strides": { "list": { "i": ["1", "1", "1", "1"] } },
          "T": { "type": "DT_FLOAT" },
          "explicit_paddings": { "list": {} },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdQ=="] } },
          "leakyrelu_alpha": { "f": 0.2 },
          "padding": { "s": "U0FNRQ==" },
          "data_format": { "s": "TkhXQw==" },
          "use_cudnn_on_gpu": { "b": true },
          "epsilon": { "f": 0.0 },
          "filter_format": { "s": "SFdJTw==" },
          "num_args": { "i": "1" },
          "num_host_args": { "i": "0" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_9/max_pooling2d_13/MaxPool",
        "op": "MaxPool",
        "input": ["StatefulPartitionedCall/sequential_9/conv2d_13/Relu"],
        "attr": {
          "padding": { "s": "VkFMSUQ=" },
          "ksize": { "list": { "i": ["1", "2", "2", "1"] } },
          "data_format": { "s": "TkhXQw==" },
          "strides": { "list": { "i": ["1", "2", "2", "1"] } },
          "explicit_paddings": { "list": {} },
          "T": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_9/conv2d_14/Relu",
        "op": "_FusedConv2D",
        "input": [
          "StatefulPartitionedCall/sequential_9/max_pooling2d_13/MaxPool",
          "StatefulPartitionedCall/sequential_9/conv2d_14/Conv2D/ReadVariableOp",
          "StatefulPartitionedCall/sequential_9/conv2d_14/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "num_args": { "i": "1" },
          "epsilon": { "f": 0.0 },
          "T": { "type": "DT_FLOAT" },
          "leakyrelu_alpha": { "f": 0.2 },
          "num_host_args": { "i": "0" },
          "explicit_paddings": { "list": {} },
          "strides": { "list": { "i": ["1", "1", "1", "1"] } },
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdQ=="] } },
          "TArgs": { "list": { "type": ["DT_FLOAT"] } },
          "data_format": { "s": "TkhXQw==" },
          "filter_format": { "s": "SFdJTw==" },
          "use_cudnn_on_gpu": { "b": true },
          "padding": { "s": "U0FNRQ==" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_9/max_pooling2d_14/MaxPool",
        "op": "MaxPool",
        "input": ["StatefulPartitionedCall/sequential_9/conv2d_14/Relu"],
        "attr": {
          "T": { "type": "DT_FLOAT" },
          "strides": { "list": { "i": ["1", "2", "2", "1"] } },
          "ksize": { "list": { "i": ["1", "2", "2", "1"] } },
          "data_format": { "s": "TkhXQw==" },
          "explicit_paddings": { "list": {} },
          "padding": { "s": "VkFMSUQ=" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_9/flatten_4/Reshape",
        "op": "Reshape",
        "input": [
          "StatefulPartitionedCall/sequential_9/max_pooling2d_14/MaxPool",
          "StatefulPartitionedCall/sequential_9/flatten_4/Const"
        ],
        "attr": {
          "Tshape": { "type": "DT_INT32" },
          "T": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_9/dense_5/Relu",
        "op": "_FusedMatMul",
        "input": [
          "StatefulPartitionedCall/sequential_9/flatten_4/Reshape",
          "StatefulPartitionedCall/sequential_9/dense_5/MatMul/ReadVariableOp",
          "StatefulPartitionedCall/sequential_9/dense_5/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdQ=="] } },
          "num_args": { "i": "1" },
          "transpose_b": { "b": false },
          "transpose_a": { "b": false },
          "epsilon": { "f": 0.0 },
          "leakyrelu_alpha": { "f": 0.2 },
          "T": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_9/outputs/BiasAdd",
        "op": "_FusedMatMul",
        "input": [
          "StatefulPartitionedCall/sequential_9/dense_5/Relu",
          "StatefulPartitionedCall/sequential_9/outputs/MatMul/ReadVariableOp",
          "StatefulPartitionedCall/sequential_9/outputs/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "num_args": { "i": "1" },
          "transpose_b": { "b": false },
          "transpose_a": { "b": false },
          "epsilon": { "f": 0.0 },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA=="] } },
          "leakyrelu_alpha": { "f": 0.2 },
          "T": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "Identity",
        "op": "Identity",
        "input": ["StatefulPartitionedCall/sequential_9/outputs/BiasAdd"],
        "attr": { "T": { "type": "DT_FLOAT" } }
      }
    ],
    "library": {},
    "versions": { "producer": 1645 }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of5.bin",
        "group1-shard2of5.bin",
        "group1-shard3of5.bin",
        "group1-shard4of5.bin",
        "group1-shard5of5.bin"
      ],
      "weights": [
        {
          "name": "StatefulPartitionedCall/sequential_9/rescaling_5/Cast/x",
          "shape": [],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_9/rescaling_5/Cast_1/x",
          "shape": [],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_9/conv2d_12/Conv2D/ReadVariableOp",
          "shape": [3, 3, 3, 16],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_9/conv2d_12/BiasAdd/ReadVariableOp",
          "shape": [16],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_9/conv2d_13/Conv2D/ReadVariableOp",
          "shape": [3, 3, 16, 32],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_9/conv2d_13/BiasAdd/ReadVariableOp",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_9/conv2d_14/Conv2D/ReadVariableOp",
          "shape": [3, 3, 32, 64],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_9/conv2d_14/BiasAdd/ReadVariableOp",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_9/flatten_4/Const",
          "shape": [2],
          "dtype": "int32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_9/dense_5/MatMul/ReadVariableOp",
          "shape": [262144, 128],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_9/dense_5/BiasAdd/ReadVariableOp",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_9/outputs/MatMul/ReadVariableOp",
          "shape": [128, 2],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_9/outputs/BiasAdd/ReadVariableOp",
          "shape": [2],
          "dtype": "float32"
        }
      ]
    }
  ]
}
